Tekla Open API Reference for Tekla Structures 2025
ModelObjectVisualization.SetTransparency Method (List<ModelObject>, TemporaryTransparency)
 Restores permanent representation settings and sets temporary transparency for given model objects
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool SetTransparency(
	List<ModelObject> modelObjects,
	TemporaryTransparency transparency
)
Public Shared Function SetTransparency (
	modelObjects As List(Of ModelObject),
	transparency As TemporaryTransparency
) As Boolean
Parameters
modelObjects
Type: System.Collections.Generic.List<ModelObject>
The list of model objects.
transparency
Type: Tekla.Structures.Model.UI.TemporaryTransparency
The temporary transparency for given objects.
Return Value
Type: Boolean
True if the temporary transparency could be set.
See Also
Reference
ModelObjectVisualization Class
SetTransparency Overload
Tekla.Structures.Model.UI Namespace